number = int(input('Введите число в диапазоне 1-7: '))    # Дано целое число в диапазоне 1–7

match number:    # Используем оператор выбора
    case 1:    # в зависимости от числа
        print('Данному числу соответствует понедельник')    # выводим соответствующий ему день
    case 2:
        print('Данному числу соответствует вторник')
    case 3:
        print('Данному числу соответствует среда')
    case 4:
        print('Данному числу соответствует четверг')
    case 5:
        print('Данному числу соответствует пятница')
    case 6:
        print('Данному числу соответствует суббота')
    case 7:
        print('Данному числу соответствует воскресенье')
    case _:    # прописываем случаи, при которых программа не будет работать
        print('Введено неправильное число!')    # выводим ошибку

quit = input('Нажмите Enter для выхода из программы') # прописываем input для ожидания выхода из программы