a = int(input('Введите первое число - '))    # Пользователь вводит 2 числа с клавиатуры
b = int(input('Введите второе число - '))

operation = int(input('Выберите операцию из списка: \n ''+'' - 1 \n ''-'' - 2 \n ''*'' - 3 \n ''/'' - 4 \n ''//'' - 5 \n ''%'' - 6 \n ''**'' - 7 \n Номер операции - '))
# Вводит номер операции из списка

match operation:    # Используем оператор выбора
    case 1:    # в зависимости от номера операции
        a += b    # производим нужную операцию над числом
        print('Результат вычислений - ', a)    # выводим новое значение числа
    case 2:
        a -= b
        print('Результат вычислений - ', a)
    case 3:
        a *= b
        print('Результат вычислений - ', a)
    case 4:
        if b == 0:
            print("На ноль делить нельзя!")
        else:
            a /= b
            print('Результат вычислений - ', a)
    case 5:
        if b == 0:
            print("На ноль делить нельзя!")
        else:
            a //= b
            print('Результат вычислений - ', a)
    case 6:
        a %= b
        print('Результат вычислений - ', a)
    case 7:
        a **= b
        print('Результат вычислений - ', a)
    case _:    # Прописываем те случаи, при которых программа не будет работать
        print('Введён неправильный номер операции!')    # выводим ошибку

quit = input('Нажмите Enter для выхода из программы') # прописываем input для ожидания выхода из программы