number = int(input('Введите номер единицы массы: 1 — килограмм, 2 — миллиграмм, 3 — грамм, 4 — тонна, 5 — центнер - '))    # Дан номер единицы массы (целое число в диапазоне 1–5)
mass = float(input('Введите массу тела - '))    # Дана масса тела в этих единицах (вещественное число)

match number:    # Используем оператор выбора
    case 1:    # в зависимости от номера единицы массы
        print('Масса тела в килограммах = ', mass)    # находим массу тела и выводим её
    case 2:
        mass /= 1000000
        print('Масса тела в килограммах = ', mass)
    case 3:
        mass /= 1000
        print('Масса тела в килограммах = ', mass)
    case 4:
        mass *= 1000
        print('Масса тела в килограммах = ', mass)
    case 5:
        mass *= 100
        print('Масса тела в килограммах = ', mass)
    case _:    # Прописываем все остальные случаи, в которых программа не будет работать
        print('Неверный номер единицы массы')    # выводим ошибку

quit = input('Нажмите Enter для выхода из программы') # прописываем input для ожидания выхода из программы